{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MusicgenMelodyForConditionalGeneration",
    "parent_library": "transformers.models.musicgen_melody.modeling_musicgen_melody"
  },
  "base_model_name_or_path": "facebook/musicgen-melody",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "lm_heads.0",
    "out_proj",
    "embed_tokens.3",
    "fc2",
    "k_proj",
    "embed_tokens.0",
    "lm_heads.2",
    "v_proj",
    "enc_to_dec_proj",
    "q_proj",
    "lm_heads.1",
    "audio_enc_to_dec_proj",
    "embed_tokens.1",
    "lm_heads.3",
    "embed_tokens.2",
    "fc1"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}